app/channels/room_channel.rb

  def speak(data)
    # ActionCable.server.broadcast 'room_channel', message: data['message']
    Message.create! content: data['message'], user_id: current_user.id, room_id: params['room_id']
---
INSERT INTO `messages` (`content`, `created_at`, `updated_at`, `user_id`, `room_id`) VALUES ('test', '2019-05-17 11:47:32', '2019-05-17 11:47:32', 1, 1)