app/controllers/rooms_controller.rb

SELECT `rooms`.* FROM `rooms` ORDER BY `rooms`.`id` ASC
---
  def index
    @rooms = Room.all.order(:id)

INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2019-05-17 11:34:58', '2019-05-17 11:34:58')
---
  def new
    Room.create!

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
---
  def show
    @room = Room.find(params[:id])